[
  {
    "company": "Con Edison",
    "role": "Senior Product Manager",
    "description": "Architected a multi-entity data privacy program, integrating a third-party SaaS platform with custom metadata retrieval systems to automate privacy operations. I currently lead the enterprise data mapping and risk scanning initiatives to identify and mitigate privacy vulnerabilities across the utility's data lake. Additionally, I chair an interdisciplinary working group focused on fraud risk management, where we design AI-enabled process enhancements to strengthen security and operational resilience.",
    "tags": ["Data Privacy", "SaaS", "Enterprise", "AI"],
    "active": true,
    "expandable": true
  },
  {
    "company": "Oracle",
    "role": "Senior Product Manager",
    "description": "Managed a core calculation engine used by global utilities for billing and scenario modeling. I directed the technical migration of this engine to a cloud-based customer care system, which improved system scalability and data accuracy for household-level utility reporting.",
    "tags": ["Cloud Migration", "Utility Billing"],
    "active": false,
    "expandable": false
  },
  {
    "company": "Morgan Stanley",
    "role": "Product Manager (AVP & Associate)",
    "description": "Managed the strategic planning and budget for a multi-year modernization of the firm's account approvals platform. I directed the rollout of a new document review workflow that ensured firm-wide compliance with tight regulatory deadlines and authored the backend requirements for unifying client data architecture.",
    "tags": ["Fintech", "Platform Architecture"],
    "active": false,
    "expandable": false
  },
  {
    "company": "Pace Energy & Climate Center",
    "role": "Energy Analyst",
    "description": "Conducted quantitative policy and market analyses to support sustainable energy initiatives in the Northeast. I developed data models and Python scripts to optimize analytical outcomes for regulatory proceedings and co-authored case studies used to influence state-level energy policy.",
    "tags": ["Energy Policy", "Data Analysis"],
    "active": false,
    "expandable": false
  },
  {
    "company": "Bloomberg",
    "role": "Research Analyst (Contractor)",
    "description": "Analyzed state and federal policy shifts regarding residential solar tariff structures. I published a case study on the scalability of New York's full-value tariff model and evaluated 38 corporate applicants for the Zayed Future Energy Prize using ESG and financial performance metrics.",
    "tags": ["Solar Energy", "ESG", "Research"],
    "active": false,
    "expandable": false
  },
  {
    "company": "BGS Energy",
    "role": "Co-Founder & Business Analyst",
    "description": "Co-founded a biofuels startup, leading negotiations with investors and engineering firms to establish initial operations. I assessed regional trade policies to identify market entry opportunities in the Caribbean and secured non-binding purchase commitments from off-takers through technical briefings.",
    "tags": ["Startup", "Biofuels", "Clean Tech"],
    "active": false,
    "expandable": false
  }
]