[
  {
    "company": "Regulated Utilities & Infrastructure",
    "role": "Senior Product Manager",
    "description": "Orchestrating enterprise-wide system transformation across one of the nation's largest regulated utilities, managing data privacy and security architecture for millions of customers. Architected a multi-entity data privacy program, integrating a third-party SaaS platform with custom metadata retrieval systems to automate privacy operations at scale. Leading the digital modernization of legacy data infrastructure to reduce technical debt and strengthen operational resilience. Chairing an interdisciplinary working group on fraud risk management, designing AI-enabled process enhancements that bridge cybersecurity governance with regulatory compliance.",
    "tags": ["System Orchestration", "Data Privacy", "Legacy Transformation", "AI"],
    "active": true,
    "expandable": true
  },
  {
    "company": "Enterprise SaaS & Cloud Platforms",
    "role": "Senior Product Manager",
    "description": "Led the digital modernization of mission-critical billing engines serving global utility clients, reducing technical debt and improving system scalability across multi-jurisdictional deployments. Directed the technical migration of a core calculation engine to a cloud-based customer care platform, enabling more accurate household-level utility reporting and streamlined scenario modeling at enterprise scale.",
    "tags": ["Cloud Migration", "Legacy Transformation", "Utility Billing"],
    "active": false,
    "expandable": false
  },
  {
    "company": "Global Financial Services",
    "role": "Product Manager",
    "description": "Drove the strategic planning and budget for a multi-year modernization of an enterprise account approvals platform — a high-stakes initiative requiring alignment across compliance, engineering, and executive stakeholders. Directed the rollout of a new document review workflow ensuring firm-wide regulatory compliance under tight deadlines and authored backend requirements for unifying the client data architecture across thousands of institutional accounts.",
    "tags": ["Fintech", "Platform Architecture", "Stakeholder Management"],
    "active": false,
    "expandable": false
  },
  {
    "company": "Energy Policy & Research",
    "role": "Energy Analyst",
    "description": "Conducted quantitative policy and market analyses to support sustainable energy initiatives across the Northeast region. Developed data models and Python scripts to optimize analytical outcomes for regulatory proceedings and co-authored case studies used to influence state-level energy policy affecting millions of ratepayers.",
    "tags": ["Energy Policy", "Data Analysis"],
    "active": false,
    "expandable": false
  },
  {
    "company": "Financial Data & Market Intelligence",
    "role": "Research Analyst",
    "description": "Analyzed state and federal policy shifts regarding residential solar tariff structures across multiple markets. Published a case study on the scalability of full-value tariff models and evaluated corporate applicants for a global energy prize using ESG and financial performance metrics.",
    "tags": ["Solar Energy", "ESG", "Research"],
    "active": false,
    "expandable": false
  },
  {
    "company": "Clean Energy Startup",
    "role": "Co-Founder & Business Analyst",
    "description": "Co-founded a biofuels venture, orchestrating negotiations with investors and engineering firms to establish initial operations. Assessed regional trade policies to identify market entry opportunities in the Caribbean and secured non-binding purchase commitments from off-takers through technical briefings — demonstrating early-career ability to navigate complex, uncharted regulatory and commercial landscapes.",
    "tags": ["Startup", "Biofuels", "Clean Tech", "System Orchestration"],
    "active": false,
    "expandable": false
  }
]
